## On this page
1. change dataframe column name
2. selecting data by operators
3. reset index
4. keep specify columns
5. sort values by column(s)
6. create new column base on other columns
7. create new columns base on rolling other columns
8.

In [1]:
import pandas as pd

### 1. change dataframe column name

In [2]:
# create a dataframe
data = pd.DataFrame({"A":[1,2,3]})

In [3]:
data

   A
0  1
1  2
2  3

In [4]:
# rename column 'A' to 'B'
data.rename(columns={'A':'B'})

   B
0  1
1  2
2  3

### 2. selecting data by operators

In [5]:
# create a dataframe
data = pd.DataFrame({"A":[1,2,3],"B":[10,11,12]})

In [6]:
data

   A   B
0  1  10
1  2  11
2  3  12

In [7]:
# single operator
data[data['A']>1]

   A   B
1  2  11
2  3  12

*logic operator*: `|` for or, `&` for and, and `~` for not

In [8]:
# logic operator (bracket needed)
data[(data['A']>1) & (data['B']<12)]

   A   B
1  2  11

### 3. reset index

In [9]:
# create a dataframe
data = pd.DataFrame({"A":[1,2,3]})

In [10]:
data

   A
0  1
1  2
2  3

In [11]:
# remove some rows
data = data[data['A']>1]

In [12]:
data

   A
1  2
2  3

In [13]:
# reset dataframe index
data.reset_index()

   index  A
0      1  2
1      2  3

### 4. keep specify columns

In [14]:
# create a dataframe
data = pd.DataFrame({"A":[1,2,3],"B":[10,11,12]})

In [15]:
data

   A   B
0  1  10
1  2  11
2  3  12

In [16]:
# keep column 'A'
data[['A']]

   A
0  1
1  2
2  3

### 5. sort values by column(s)

In [17]:
# create a dataframe
data = pd.DataFrame({"A":[3,1,2],"B":['b','c','a']})

In [18]:
data

   A  B
0  3  b
1  1  c
2  2  a

In [19]:
# sort by single column
data.sort_values(by = 'A')

   A  B
1  1  c
2  2  a
0  3  b

In [20]:
# set ascending
data.sort_values(by = 'A', ascending = False)

   A  B
0  3  b
2  2  a
1  1  c

In [21]:
# sort by multi-columns
data.sort_values(by = ['A','B'])

   A  B
1  1  c
2  2  a
0  3  b

### 6. create new column base on other columns

In [22]:
# create a dataframe
data = pd.DataFrame({"A":[1,2,3],"B":[10,11,12]})

In [23]:
data

   A   B
0  1  10
1  2  11
2  3  12

**axis** :{0 or ‘index’, 1 or ‘columns’}, default 0
Axis along which the function is applied:
- 0 or ‘index’: apply function to each column.
- 1 or ‘columns’: apply function to each row.

In [24]:
# base column 'A' and 'B'
data.apply(lambda row: row['A'] + row['B'], axis=1)

0    11
1    13
2    15
dtype: int64

In [25]:
# create new column 'C'
data['C'] = data.apply(lambda row: row['A'] + row['B'], axis=1)

In [26]:
data

   A   B   C
0  1  10  11
1  2  11  13
2  3  12  15

inner logic could packaged as a function:

In [27]:
# create a function 
def do(row):
    return row['A']+row['B']

# use it
data.apply(lambda row: do(row), axis=1)

0    11
1    13
2    15
dtype: int64

### 7. create new columns base on rolling other columns

In [28]:
# create a dataframe
data = pd.DataFrame({"A":[1,2,3],"B":[10,11,12]})

In [29]:
data

   A   B
0  1  10
1  2  11
2  3  12

In [30]:
# rolling apply
def do(x):
    print(len(x)) # print x's len for debug. x is window result array
    return x[1]+x[0]
    
data['A'].rolling(2).apply(do, raw=True)

2
2

0    NaN
1    3.0
2    5.0
Name: A, dtype: float64

In [34]:
# create new column base rolling apply result
data['C'] = data['A'].rolling(2).apply(do, raw=True)

2
2

In [35]:
data

   A   B    C
0  1  10  NaN
1  2  11  3.0
2  3  12  5.0

### 8. format column to datetime

In [36]:
# create a dataframe
data = pd.DataFrame({"A":['20210101','20210102'],"B":['2021-01-01','2021-01-02']})

In [37]:
data

          A           B
0  20210101  2021-01-01
1  20210102  2021-01-02

In [38]:
pd.to_datetime(data['A'],format='%Y%m%d')

0   2021-01-01
1   2021-01-02
Name: A, dtype: datetime64[ns]

In [40]:
pd.to_datetime(data['B'],format='%Y-%m-%d')

0   2021-01-01
1   2021-01-02
Name: B, dtype: datetime64[ns]

### 9. merge dataframe like left join

In [41]:
# create a dataframe
data1 = pd.DataFrame({"A":[1,2,3],"B":['a','b','c']})

In [42]:
data1

   A  B
0  1  a
1  2  b
2  3  c

In [43]:
# create a dataframe
data2 = pd.DataFrame({"A":[2,3],"C":[22,33]})

In [44]:
data2

   A   C
0  2  22
1  3  33

In [45]:
# merge data1 left join data2 on 'A'
pd.merge(data1,data2,on='A')

   A  B   C
0  2  b  22
1  3  c  33